    # Задание.Показать первую цифру дробной части числа.
def First_Number(number):
    bof = int((number*10)%10)
    print(bof)

First_Number(489.19)    

