# Задание. Вывести на экран числа от -N до N.
def countN (a):
     for i in range(-a,a+1):
      print (i)

countN(5)


