# Экстра задача №4 к 3-му ДЗ.
#  Сумма квадратов первых десяти натуральных чисел равна
# 12 + 22 + ... + 102 = 385
# Квадрат суммы первых десяти натуральных чисел равен
# (1 + 2 + ... + 10)2 = 552 = 3025
# Следовательно, разность между суммой квадратов и квадратом суммы
#  первых десяти натуральных чисел составляет 3025 − 385 = 2640.
# Найдите разность между суммой квадратов и квадратом суммы первых ста натуральных чисел.

# 1st let's try obvious solution
n = 100
num1 = sum(i for i in range(1, n + 1))
num2 = sum(i**2 for i in range(1, n + 1))
print('obvious solution:',num1**2 - num2)

# summ from 1 to N: S1 = (1 + N) + (2 + N - 1) + (3 + N - 2)... N / 2 times => S1 = N * (N + 1) / 2
summ1 = int(n * (n + 1) / 2)
# summ from 1**2 to N**2: using formula for S2 => S2 = S1 * (2N + 1) / 3 = (N + 1) * (2N + 1) / 6
summ2 = int(n * (n + 1) * (2 * n + 1) / 6)

print('simplified solution:',summ1 ** 2 - summ2)

