# Задача №4 к 3-му ДЗ. Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]

lst = [1, 2, 3, 5, 1, 5, 3, 10]

uniq_lst = list()
for val in lst:
    if val not in uniq_lst:
        uniq_lst.append(int(val))
print(lst, '=>', uniq_lst)
